{
    "title": "Warframes",
    "criteria": [
        {
            "name": "Survivability",
            "description": "Does the frame have survivability that allows them to hold their own in high level content?",
            "options": [
                {
                    "score": 1,
                    "description": "Yes, but it has usability issues or a critical flaw"
                },
                {
                    "score": 2,
                    "description": "Can provide its own survivability in almost any content"
                },
                {
                    "score": 2.5,
                    "description": "Can also extend that survivability to the rest of the group"
                }
            ]
        },
        {
            "name": "Damage",
            "description": "Does the frame provide additional damage output in some way that is not made irrelevant by your regular weaponry?",
            "options": [
                {
                    "score": 0.5,
                    "description": "Yes, but it does not scale well past low level content"
                },
                {
                    "score": 1,
                    "description": "It scales to high level content, but has usability issues or a critical flaw"
                },
                {
                    "score": 2,
                    "description": "The warframe provides significant damage in the form of ability damage or weapon buffs that is clearly beneficial alongside regular weaponry"
                }
            ]
        },
        {
            "name": "Objectives",
            "description": "Does the frame have an ability specifically suited to mission objectives?",
            "options": [
                {
                    "score": 0.5,
                    "description": "Yes, but even in suitable mission types it has a critical flaw"
                },
                {
                    "score": 1,
                    "description": "Yes, but it only excels at specific niches OR has usability issues despite being widely effective"
                },
                {
                    "score": 2,
                    "description": "It is the frame of choice for its specific niche or it excels at many mission types"
                }
            ]
        },
        {
            "name": "Utility",
            "description": "Does the frame offer additional utility beyond survivability or damage?",
            "options": [
                {
                    "score": 0.5,
                    "description": "The frame has increased mobility or some other advantage"
                },
                {
                    "score": 1,
                    "description": "The frame greatly benefits the group beyond providing survivability or damage"
                }
            ]
        }
    ],
    "grades": {
        "7.5": "Nerf Needed",
        "7": "S+",
        "6.5": "S",
        "6": "A+",
        "5.5": "A",
        "5": "A-",
        "4.5": "B+",
        "4": "B",
        "3.5": "B-",
        "3": "C+",
        "2.5": "C",
        "2": "C-",
        "1.5": "D+",
        "1": "D",
        "0.5": "D-",
        "0": "F"
    },
    "items": [
        {
            "name": "Octavia",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2.5,
                    "comment": "Octavia provides infinite invisibility for the entire team. Her survivability is only vulnerable to area damage."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "The damage from mallet scales quickly and infinitely for the duration, capable of killing enemies of any level. Octavaia also provides various buffs increasing weapon damage."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Wisp",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2.5,
                    "comment": "Wisp's vitality motes grant the entire team maximum health and healing that is sufficient to survive most content. Additionally, shock motes provide crowd control to reduce incoming damage."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Wisp's haste mote significantly increases the damage of the entire team."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Vitality motes apply to defense objectives, and reservoirs are well suited to any mission that does not involve constant relocation."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Wisp has various sources of increased mobility, including movement speed for her allies."
                }
            ]
        },
        {
            "name": "Nova",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Null Star provides enough damage mitigation to survive any content, especially when paired with Adaptation. There are two augments that help maintain charges of Null Star."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "All enemies afflicted by Molecular Prime take double damage regardless of ability strength. Additionally, Antimatter Drop can provide immense damage output (also regardless of ability strength)."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Nova has exceptional control over enemies, speeding the up to make defense missions go faster or slowing them down to trivialize mobile defense, disruption, and more."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Nova's portals provide a unique mobility advantage."
                }
            ]
        },
        {
            "name": "Chroma",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Between the armor from Vex Armor and the defensive effects of Elemental Ward (cold), Chroma's only defensive weakness is a lack of self-healing."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Vex Armor is one of the largest damage buffs in the game. While it can be outclassed by Mirage's Eclipse or Harrow's Covenant, Vex Armor is the most consistent of the three."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Chroma is the most prominent boss killer in Warframe and is most people's frame of choice for eidolons and profit taker."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Khora",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Venari's healing is somewhat unreliable and Khora must rely on her crowd control to stay alive."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Accumulating Whipclaw allows Khora to do high damage in any level of content."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Strangledome is a suitable tactic in static defense missions, and trivializes the early waves of kuva survival, but lifting enemies into the air often makes it difficult for allies to shoot them."
                },
                {
                    "criteria": "Utility",
                    "score": 1,
                    "comment": "Pilfering Strangledome offers increased loot in a game about getting loot."
                }
            ]
        },
        {
            "name": "Mesa",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Shatter Shield provides enough damage mitigation to survive any content, especially when paired with Adaptation. Mesa's only defensive vulnerability is to melee attackers."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Peacemaker is one of the fastest ways to clear a room in the entirety of Warframe, and this remains true in high level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Mesa's crowd clearing ability trivializes many missions in a way regular weaponry cannot."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Saryn",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Saryn has enough base armor that her Regenerative Molt augment can keep her alive even at high levels."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Spores spread widely and scale infinitely, Toxic Lash increases weapon damage, and Miasma applies viral to enemies while further increasing the effect of Spores."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Saryn's crowd clearing ability trivializes many missions in a way regular weaponry cannot. She is one of the frames of choice for sanctuary onslaught and interception."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Molt grants Saryn a large movement speed boost."
                }
            ]
        },
        {
            "name": "Gara",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2.5,
                    "comment": "Splinter Storm provides enough damage mitigation to survive any content, especially when paired with Adaptation. It can also be applied to allies."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Splinter Storm's damage scales infinitely if maintained, however it takes time to ramp up and is dependent on your melee weapon."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Mass Vitrify is ideal for any static defense mission. Splinter Storm can provide damage mitigation to any defense target, including operatives and cryotic extractors."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Gauss",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Kinetic Plating provides enough damage mitigation to survive any content, especially when paired with Adaptation."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Redline significantly increases fire rate, reload speed, and melee attack speed."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Gauss's mobility and offensive capabilities are especially well suited to disruption."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Mach Rush offers a significant mobility advantage. Thermal Sunder also offers the ability to strip enemy armor."
                }
            ]
        },
        {
            "name": "Protea",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Grenade Fan offers survivability for the entire group, though the duration and method of application make it difficult to maintain on others. Dispensary provides healing to counter damage types that ignore shields."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Blaze Artillery deals enough damage to be a reliable tool in high level missions."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Grenade Fan can apply shields to defense targets such as operatives, but is difficult to maintain."
                },
                {
                    "criteria": "Utility",
                    "score": 1,
                    "comment": "Dispensary provides ammo and energy for the entire team."
                }
            ]
        },
        {
            "name": "Titania",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2.5,
                    "comment": "Between Thorns, Dust, and Razorwing, Titania can survive without issue in most content. The addition of Aviator and Adaptation to her loadout can further improve her survivability. Thorns and Dust also apply to allies within 35m."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Dex Pixia offers sufficient damage against any enemy that is not immune to status procs."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "The ability to fly trivializes multiple objectives and challenges, and Titania is one of the frames of choice for the Plague Star event."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Spellbind grants status immunity, and Titania has increased mobility both in and out of Razorwing."
                }
            ]
        },
        {
            "name": "Trinity",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2.5,
                    "comment": "Bless offers wide-range healing and damage mitigation for the entire team."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Trinity is the frame of choice for defection, and has an important role in eidolon hunts and Grendel farming."
                },
                {
                    "criteria": "Utility",
                    "score": 1,
                    "comment": "Energy Vampire grants the entire team effectively infinite energy."
                }
            ]
        },
        {
            "name": "Ivara",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Stealth is sufficient in almost all content, however the reduced movement speed is a significant disadvantage."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Empowered Quiver offers a large damage buff, but severely limits your movement."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Ivara is ideal for spy missions and various riven challenges."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Pickpocketing offers a somewhat limited increase in loot."
                }
            ]
        },
        {
            "name": "Nekros",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Shield of Shadows provides enough damage mitigation to survive any content, especially when paired with Adaptation."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Nekros is ideal for long survival missions and challenges that don't allow the use of life support pods."
                },
                {
                    "criteria": "Utility",
                    "score": 1,
                    "comment": "Desecrate offers increased loot in a game about getting loot."
                }
            ]
        },
        {
            "name": "Rhino",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Iron Skin is sufficient for all levels of content, especially when paired with Ironclad Charge."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Roar increases weapon damage enough to be useful at all levels, and Rhino Stomp provides map clear at low levels."
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Rhino is the frame of choice for the Index and for derelict vault runs."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Ash",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Smoke Screen may have a short duration but is easy to maintain. Ash's only defensive weakness is to area damage. Smoke Shadow is too short range to reliably maintain invisibility for allies."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Blade Storm can kill enemies of almost any level, even if they have high armor."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Teleport offers a significant mobility advantage. Seeking Shuriken can also provide armor strip."
                }
            ]
        },
        {
            "name": "Mag",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Mag relies on crowd control from Counter Pulse and/or Fracturing Crush to stay alive."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Magnetize can allow projectile weapons to do massive damage."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Map clear does not scale past low level missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Polarize and Fracturing Crush both offer armor strip."
                }
            ]
        },
        {
            "name": "Revenant",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Mesmer Skin makes Revenant effectively invulnerable, but may have to be reapplied frequently when surrounded by a large number of enemies."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Danse Macabre's adaptive damage can kill armored enemies in high level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Danse Macabre offers effective map clear, though unlike many alternatives it requires line of sight to the enemies."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Ember",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Immolation provides provides enough damage mitigation to survive any content, especially when paired with Adaptation."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Ember's damage does not scale beyond low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "For the missions in which Ember's damage is sufficient, she offers effective map clear."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Heat procs strip armor in a wide area."
                }
            ]
        },
        {
            "name": "Frost",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Standing within Snow Globe offers some protection at the cost of mobility."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 2,
                    "comment": "Frost is one of the frames of choice for static defense missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Avalanche strips armor."
                }
            ]
        },
        {
            "name": "Inaros",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Scarab Swarm grants Inaros significant damage mitigation. Finishers (via Desiccation) allow Inaros to quickly heal himself."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Desiccation opens enemies to finisher attacks."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Inaros is one of the frames of choice for hijack missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Hildryn",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Hildryn can become nearly invulnerable due to her improved shield gating."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Hildryn is one of the frames of choice for hijack missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Can remove status effects from the entire team."
                }
            ]
        },
        {
            "name": "Grendel",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Between innate bulk, crowd control, and Nourish's self-healing, Grendel can survive most content."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Feast is an effective way to kill even high level enemies, however it can be slow and may delay the next rotation in some mission types."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": "Feast does strip armor from enemies, but it also prevents the enemy from being attacked with regular weaponry."
                }
            ]
        },
        {
            "name": "Nidus",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Between innate bulk, crowd control, and self-healing from Ravenous, Nidus can survive almost any content."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Larva combined with Virulence can kill most enemies, but at higher levels these abilities often struggle against armor."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Nidus is a suitable choice for hijack missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Valkyr",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "On top of having the highest base armor in the game, Valkyr's Hysteria ability provides invulnerability and self-healing."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "While Hysteria is strong, it is often more effective to use Warcry to increase the attack speed of your normal melee weapon."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Rip Line offers some unique mobility."
                }
            ]
        },
        {
            "name": "Volt",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Electric Shield and Discharge offer two effective damage sources"
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Volt's primary use is in eidolon hunts. Discharge also offers effective map clear."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Speed grants mobility to the entire team."
                }
            ]
        },
        {
            "name": "Harrow",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Harrow's Covenant and shield regeneration from Condemn allow him to survive most content, but they can be difficult to maintain and Harrow is still often vulnerable."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Covenant offers a large increase in critical chance, however it necessitates you delay attacking until it is done so it is often more effective to use regular weaponry."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Harrow is an effective choice for eidolon hunts."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Thurible offers some energy regeneration for allies, but can be difficult to use effectively."
                }
            ]
        },
        {
            "name": "Nezha",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Warding Halo allows Nezha to survive almost any content."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Fire Walker and Divine Spears provide low level area damage, but do not scale well."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Nezha has increased mobility and offers armor reduction from heat procs."
                }
            ]
        },
        {
            "name": "Oberon",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Renewal allows Oberon to survive most content, especially with the Phoenix Renewal augment. Oberon may struggle at high levels when Renewal cannot keep up with incoming damage."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Hallowed Ground and Reckoning offer some amount of map clear, while Smite Infusion can be used to buff weapons."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Oberon is a solid choice for eidolon hunts, however his map clearing abilities do not scale well beyond low level content."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Armor reduction from Reckoning and heat procs."
                }
            ]
        },
        {
            "name": "Zephyr",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Turbulence offers immunity to many forms of damage. Zephyr's main defensive weaknesses are to melee enemies and area damage."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Tornado does not scale well past low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Zephyr gains mobility from Tail Wind and her passive."
                }
            ]
        },
        {
            "name": "Atlas",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Rubble grants Atlas a high amount of armor, but he can struggle to maintain Rubble."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Landslide offers significant damage, but relies on maintaining combo."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Tectonics can be used to prevent enemies from scoring in the Index."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Equinox",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Maim's ability to echo damage dealt within the radius is incredibly strong and scales well to any level."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Wide map clear allows for focus farming on low level defense maps, however this is a somewhat outdated strategy."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Loki",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Easily mintained Invisibility means that Loki is only vulnerable to area damage."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Loki is useful for many riven challenges."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Limbo",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "While being in the Rift makes Limbo effectively invulnerable, this often comes with the issue of not being able to damage enemies without sacrificing that safety."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Cataclysm does not scale well beyond low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Cataclysm is an effective way to protect defense targets, and Limbo does trivialize some spy missions, however his Rift mechanic is often more frustrating than it is worth."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Wukong",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 2,
                    "comment": "Between Defy, Cloud Walker, and passive effects, Wukong is an incredibly durable warframe."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": "Primal Fury does not offer damage beyond what can be achieved with a regular melee weapon."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Cloud Walker provides a significant amount of mobility."
                }
            ]
        },
        {
            "name": "Banshee",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": "Silence is not sufficient to keep Banshee safe in high level content."
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Sonar increases weapon damage and scales well in higher level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Wide map clear allows for focus farming on low level defense maps, however this is a somewhat outdated strategy."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Garuda",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Dread Mirror is effective, but only protects Garuda from the front."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Seeking Talons does not scale well beyond low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 0.5,
                    "comment": "Seeking Talons offers long range map clear in low level missions."
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Garuda has increased mobility from Dread Mirror and personal energy regeneration from Bloodletting."
                }
            ]
        },
        {
            "name": "Mirage",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Eclipse is an unreliable defensive ability."
                },
                {
                    "criteria": "Damage",
                    "score": 2,
                    "comment": "Hall of Mirrors offers increased weapon damage, especially with Hall of Malevolence. While Eclipse also offers increased weapon damage, it is unreliable."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Baruuk",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Elude and Desolate Hands are both unreliable. Baruuk must rely on Lull to counteract that inconsistency."
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Serene Storm cannot be used all the time and unless using Reactive Storm it is not as effective as regular melee weapons."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Excalibur",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Damage",
                    "score": 1,
                    "comment": "Exalted Blade with Chromatic Blade (heat) can be more effective than regular melee weapons."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0.5,
                    "comment": "Radial Howl removes sentient resistance. This benefit only applies to Umbra."
                }
            ]
        },
        {
            "name": "Hydroid",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "Tempest Barrage and Tentacle Swarm do not scale well beyond low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 1,
                    "comment": "Pilfering Swarm offers increased loot in a game about getting loot."
                }
            ]
        },
        {
            "name": "Vauban",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Damage",
                    "score": 0.5,
                    "comment": "While Tesla Nervos, Flechette Orb, and Photon Strike are all useful, none of them scale well beyond low level content."
                },
                {
                    "criteria": "Objectives",
                    "score": 1,
                    "comment": "Bastille's vortex is useful for static defense, but can trap enemies in awkward ways that slow down the mission."
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        },
        {
            "name": "Nyx",
            "scores": [
                {
                    "criteria": "Survivability",
                    "score": 1,
                    "comment": "Absorb offers survivability, but even with Assimilate the reduced mobility is a significant usability issue."
                },
                {
                    "criteria": "Damage",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Objectives",
                    "score": 0,
                    "comment": ""
                },
                {
                    "criteria": "Utility",
                    "score": 0,
                    "comment": ""
                }
            ]
        }
    ]
}